// основной

// let age = prompt('ведите возраст')
// if(age <30 && age>0){
//     console.log('Вы молодой человек')
// }
// else if(age <60 && age>30){
//     console.log('Кризиз средного возраста')
// }
// else if(age>60){
//     console.log('Саветую посетит доктара')
// }
// else if(age<0){
//     console.log('Вы ешё не родилис')
// }



// --------------------------------------------------------------------------------------------------






// доп

// const pr = prompt("Введите значение:");

// const number = parseFloat(pr);

// if (!isNaN(number)) {
//     alert("Вы ввели число: " + number);
// } else {
//     alert("Введено некорректное значение");
// }
